Revit 2027 API
IndexBuffer.Unmap Method
 Unmaps the buffer so that it can be used for rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Unmap()
Public Sub Unmap
public:
void Unmap()
member Unmap : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This IndexBuffer is not available because Revit is not currently rendering. In general, this IndexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
See Also
Reference
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace